/*
Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
*/

// int Sum(int number)
// {
//     int res =0;
//     while(number>0)
//     {
//         res= res + number%10;
//         number/=10;

//     }
//     return res;

// }


// try
// {Console.WriteLine("Введите число ");
// int num = Convert.ToInt32(Console.ReadLine());

// int result = Sum(num);
//  System.Console.WriteLine($"сумма цифр в числе {num} = {result}");}

// catch
// {
//     System.Console.WriteLine("Введите целое число");
// }